<template>
    <div class="app__main">
        <div class="about">
            <div class="container">
                <div class="about__block">
                    <div class="about__content text">
                        <h2>Информация о площадке</h2>
                        <p>Описание целей данной площадки, которые раскрывают основные цели ее создания и дальнейшего развития.  Описание целей данной площадки, которые раскрывают основные цели ее создания и дальнейшего развития. Описание целей данной площадки, которые раскрывают основные цели ее создания и дальнейшего развития.  Описание целей данной площадки, которые раскрывают основные цели ее создания и дальнейшего развития. Описание целей данной площадки, которые раскрывают основные цели ее создания и дальнейшего развития. Описание целей данной площадки, которые раскрывают основные цели ее создания и дальнейшего развития.</p>
                    </div>
                </div>
                <div class="about__block">
                    <div class="about__content text">
                        <h2>Ключевые возможности</h2>
                        <ul class="m--inline">
                            <li>Вложенные тендеры</li>
                            <li>Оценка поставщиков, система качества</li>
                            <li>Аналитика по тендерам</li>
                            <li>Общение по каждому тендеру</li>
                            <li>Удобное хранилище типовых документов</li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    // import Header from '../components/app-header.vue';

    export default {
        name: 'About',
        components: {
            //Header,
        },
        created() {
        },
        data() {
            return {
            };
        },
    };
</script>
