<template>
    <div class="app__main">
        <div class="groups">
            <div class="container">
                <div class="groups__blocks">
                    <div
                        v-for="(group, key) in groups"
                        :key="key"
                        class="group"
                    >
                        <div class="group__title">
                            {{ group.title }}
                        </div>
                        <div class="group__info">
                            <div class="group__info-trades">
                                Активных торгов: <span class="group__info-red">{{ group.trades }}</span>
                            </div>
                            <div class="group__info-date">
                                Последний аукцион: <span class="group__info-red">{{ group.date }}</span>
                            </div>
                        </div>
                        <Transition name="">
                            <ul
                                v-show="group.isShowProducts"
                                class="group__products"
                            >
                                <li
                                    v-for="(product, _key) in group.products.split(', ')"
                                    :key="_key"
                                    class="group__products-item"
                                    v-text="product"
                                />
                            </ul>
                        </Transition>
                        <div
                            class="group__toggle"
                            :class="{'group__toggle--active': group.isShowProducts}"
                            @click="group.isShowProducts = !group.isShowProducts"
                            v-text="group.isShowProducts ? 'Скрыть информацию' : 'Показать информацию'"
                        />
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        name: 'Groups',
        components: {
        },
        data() {
            return {
                groups: [
                    {
                        title: 'Услуги по удалению отходов, Экология, Химчистка',
                        trades: 6,
                        date: '24.03.2022 18:32 МСК',
                        products: 
                            `Мясо, Мясные продукты, Продукция животноводства и охоты.
                            Чай, Кофе, Какао, Соль, Сахар, Специи, Пищевые добавки, Консервы, Бакалея
                            .
                            Рыба, Морепродукты, Продукция рыболовства
                            Детское питание, Диетическое питание
                            .
                            Птица, Яйцо, Продукция птицеводства.
                            Корма для животных.
                            Продукция лесничества, Дикоросы, Мед, Орехи, Грибы
                            .
                            Цветы, Семена, Саженцы.
                            Крупы, Макароны, Хлебобулочные изделия, Крупяная и макаронная продукция, Зерно, Злаки.
                            Табачная продукция.
                            Овощи, Фрукты, в том числе консервированные, Сухофрукты
                            .
                            Прочие продукты питания.
                            Молочная продукция, Сыры, Мороженое
                            .
                            Прочая продукция сельского хозяйства, животноводства, рыболовства, охоты.
                            Напитки алкогольные и безалкогольные, Вода бутилированная, Соки
                            .`
                        
                    },
                    {
                        title: 'Фармацевтическая продукция. Продукция медицинского назанчения',
                        trades: 4,
                        date: '24.03.2022 18:32 МСК',
                        products: 
                            `Мясо, Мясные продукты, Продукция животноводства и охоты.
                            Чай, Кофе, Какао, Соль, Сахар, Специи, Пищевые добавки, Консервы, Бакалея
                            .
                            Рыба, Морепродукты, Продукция рыболовства
                            Детское питание, Диетическое питание
                            .
                            Птица, Яйцо, Продукция птицеводства.
                            Корма для животных.
                            Продукция лесничества, Дикоросы, Мед, Орехи, Грибы
                            .
                            Цветы, Семена, Саженцы.
                            Крупы, Макароны, Хлебобулочные изделия, Крупяная и макаронная продукция, Зерно, Злаки.
                            Табачная продукция.
                            Овощи, Фрукты, в том числе консервированные, Сухофрукты
                            .
                            Прочие продукты питания.
                            Молочная продукция, Сыры, Мороженое
                            .
                            Прочая продукция сельского хозяйства, животноводства, рыболовства, охоты.
                            Напитки алкогольные и безалкогольные, Вода бутилированная, Соки
                            .`
                        
                    },
                    {
                        title: 'Продукты питания, Продукция сельского и лесного хозяйства, Животноводства, Рыболовства',
                        trades: 20,
                        date: '24.03.2022 18:32 МСК',
                        products: 
                            `Мясо, Мясные продукты, Продукция животноводства и охоты.
                            Чай, Кофе, Какао, Соль, Сахар, Специи, Пищевые добавки, Консервы, Бакалея
                            .
                            Рыба, Морепродукты, Продукция рыболовства
                            Детское питание, Диетическое питание
                            .
                            Птица, Яйцо, Продукция птицеводства.
                            Корма для животных.
                            Продукция лесничества, Дикоросы, Мед, Орехи, Грибы
                            .
                            Цветы, Семена, Саженцы.
                            Крупы, Макароны, Хлебобулочные изделия, Крупяная и макаронная продукция, Зерно, Злаки.
                            Табачная продукция.
                            Овощи, Фрукты, в том числе консервированные, Сухофрукты
                            .
                            Прочие продукты питания.
                            Молочная продукция, Сыры, Мороженое
                            .
                            Прочая продукция сельского хозяйства, животноводства, рыболовства, охоты.
                            Напитки алкогольные и безалкогольные, Вода бутилированная, Соки
                            .`
                        
                    },
                    {
                        title: 'медицинские и оздоровительные услуги',
                        trades: 0,
                        date: '24.03.2022 18:32 МСК',
                        products: 
                            `Мясо, Мясные продукты, Продукция животноводства и охоты.
                            Чай, Кофе, Какао, Соль, Сахар, Специи, Пищевые добавки, Консервы, Бакалея
                            .
                            Рыба, Морепродукты, Продукция рыболовства
                            Детское питание, Диетическое питание
                            .
                            Птица, Яйцо, Продукция птицеводства.
                            Корма для животных.
                            Продукция лесничества, Дикоросы, Мед, Орехи, Грибы
                            .
                            Цветы, Семена, Саженцы.
                            Крупы, Макароны, Хлебобулочные изделия, Крупяная и макаронная продукция, Зерно, Злаки.
                            Табачная продукция.
                            Овощи, Фрукты, в том числе консервированные, Сухофрукты
                            .
                            Прочие продукты питания.
                            Молочная продукция, Сыры, Мороженое
                            .
                            Прочая продукция сельского хозяйства, животноводства, рыболовства, охоты.
                            Напитки алкогольные и безалкогольные, Вода бутилированная, Соки
                            .`
                        
                    },
                ]
            };
        },
    };
</script>
