<template>
    <div class="app__main">
        <div class="rules">
            <div class="container">
                <div class="rules__block">
                    <div class="rules__content text">
                        <h2>Регламент работы на торговой площадке “TUGAN”</h2>
                        <ul>
                            <li>Общие положения</li>
                            <li>Присоединение к Регламенту</li>
                            <li>Порядок расторжения Регламента</li>
                            <li>Изменение (дополнения) Регламента</li>
                            <li>Электронная площадка</li>
                            <li>Оператор электронной площадки</li>
                            <li>Регистрация на электронной площадке</li>
                            <li>Представление организатором торгов заявок на проведение торгов</li>
                            <li>Представление заявок на участие в торгах</li>
                            <li>Определение участников торгов</li>
                            <li>Проведение торгов</li>
                            <li>Порядок подведения результатов проведения торгов и признания торгов несостоявшимися</li>
                            <li>Разрешение разногласий (споров) между Участниками и Организаторами торгов, связанных с проведением торгов</li>
                            <li>Заключительные положения</li>
                        </ul>
                    </div>
                </div>
                <div class="rules__block">
                    <div class="rules__content text">
                        <h2>Регламент работы поставщиков</h2>
                        <h3>Определение основных понятий, используемых в Регламенте</h3>
                        <ul>
                            <li>Электронная торговая площадка "TUGAN"  (далее – электронная торговая площадка, ЭТП) – аппаратно-программный комплекс, расположенный в информационно-телекоммуникационной сети «Интернет» по электронному адресу https://tugan.ru/ , предназначенный для проведения торгов в электронной форме.</li>
                            <li>Авторизация – получение Участником ЭТП доступа к закрытой части ЭТП путем ввода логина и пароля в систему.</li>
                            <li>Закрытая часть ЭТП – часть электронной площадки, доступная только зарегистрированным и авторизованным на ЭТП лицам.</li>
                            <li>Заявитель – Участник ЭТП, подающий какие-либо заявление или заявку в установленном настоящим Регламентом порядке.</li>
                            <li>Участник ЭТП – лицо, прошедшее Регистрацию на ЭТП.</li>
                            <li>Карточка торгов – часть ЭТП, содержащая сведения о конкретных торгах, в т.ч. извещение о проведении торгов, документацию о торгах, сведения об организаторе и участниках торгов, стадии торгов, принятых в ходе торгов решениях, результатах торгов, предоставляющая возможность для определенных категорий пользователей выполнять различные действия в ходе торгов.</li>
                            <li>«Личный кабинет» – доступный конкретному Пользователю после регистрации на электронной торговой площадке, с использованием логина и пароля, набор программных инструментов, позволяющих получать предоставляемые Оператором услуги.</li>
                            <li>Оператор ЭТП – лицо, владеющее электронной торговой площадкой "TUGAN", в т.ч. сайтом в информационно-телекоммуникационной сети «Интернет», программно-аппаратными средствами, обеспечивающими деятельность ЭТП,  имеющее подтвержденное в установленном порядке право обеспечивать торги конкретного вида в электронной форме.</li>
                            <li>Организатор торгов – Участник ЭТП, имеющий основанное на нормативном акте или договоре право организовывать торги конкретного вида в электронной форме.</li>
                            <li>Открытая часть ЭТП – общедоступная часть ЭТП, не требующая регистрации на ЭТП для доступа к ней.</li>
                            <li>Официальный сайт в сети «Интернет» - сайт в сети «Интернет», определенный уполномоченным органом государственной власти для размещения информации о проведении  торгов конкретных видов в электронной форме.</li>
                            <li>Программно-аппаратные средства ЭТП (далее – средства ЭТП) – совокупность программных материалов, оборудования и техники, шаблонов, процедур и стандартов действий, обеспечивающих функционирование ЭТП.</li>
                            <li>Протокол проведения торгов – автоматически формируемый средствами ЭТП неизменяемый протокол, отражающий действия Участников торгов непосредственно в процедуре их проведения, доступ к которому до окончания торгов не имеет ни одно из действующих на ЭТП лиц.</li>
                            <li>Регистрация ─ процедура фиксации в установленном порядке лиц на ЭТП и получение доступа к закрытой части ЭТП.</li>
                            <li>Сертификат ключа проверки электронной подписи - электронный документ или документ на бумажном носителе, выданные удостоверяющим центром либо доверенным лицом удостоверяющего центра и подтверждающие принадлежность ключа проверки электронной подписи владельцу сертификата ключа проверки электронной подписи.</li>
                            <li>Ставка, предложение о цене – предложение о цене предмета торгов, подаваемое заявителем (претендентом) и/или участником торгов в установленном Организатором торгов порядке.</li>
                            <li>Торги, торговая процедура – проходимые в установленном порядке на ЭТП в электронной форме аукцион.</li>
                            <li>Электронный образ документа – документ на бумажном носителе, преобразованный в электронно-цифровую форму путем сканирования с сохранением их реквизитов.</li>
                            <li>Электронный документ – документ, в котором информация представлена в электронно-цифровой форме, в т.ч. электронный образ документа.</li>
                        </ul>
                    </div>
                </div>
                <div class="rules__block">
                    <div class="rules__content text">
                        <h2>Регламент работы организаторов торгов</h2>
                        <h3>Определение основных понятий, используемых в Регламенте</h3>
                        <ul>
                            <li>Электронная торговая площадка "TUGAN"  (далее – электронная торговая площадка, ЭТП) – аппаратно-программный комплекс, расположенный в информационно-телекоммуникационной сети «Интернет» по электронному адресу <a href="https://tugan.ru/">https://tugan.ru/</a>, предназначенный для проведения торгов в электронной форме.</li>
                            <li>Авторизация – получение Участником ЭТП доступа к закрытой части ЭТП путем ввода логина и пароля в систему.</li>
                            <li>Закрытая часть ЭТП – часть электронной площадки, доступная только зарегистрированным и авторизованным на ЭТП лицам.</li>
                            <li>Заявитель – Участник ЭТП, подающий какие-либо заявление или заявку в установленном настоящим Регламентом порядке.</li>
                            <li>Участник ЭТП – лицо, прошедшее Регистрацию на ЭТП.</li>
                            <li>Карточка торгов – часть ЭТП, содержащая сведения о конкретных торгах, в т.ч. извещение о проведении торгов, документацию о торгах, сведения об организаторе и участниках торгов, стадии торгов, принятых в ходе торгов решениях, результатах торгов, предоставляющая возможность для определенных категорий пользователей выполнять различные действия в ходе торгов.</li>
                            <li>«Личный кабинет» – доступный конкретному Пользователю после регистрации на электронной торговой площадке, с использованием логина и пароля, набор программных инструментов, позволяющих получать предоставляемые Оператором услуги.</li>
                            <li>Оператор ЭТП – лицо, владеющее электронной торговой площадкой "TUGAN", в т.ч. сайтом в информационно-телекоммуникационной сети «Интернет», программно-аппаратными средствами, обеспечивающими деятельность ЭТП,  имеющее подтвержденное в установленном порядке право обеспечиватьторги конкретного вида в электронной форме.</li>
                            <li>Организатор торгов – Участник ЭТП, имеющий основанное на нормативном акте или договоре право организовывать торги конкретного вида в электронной форме.</li>
                            <li>Открытая часть ЭТП – общедоступная часть ЭТП, не требующая регистрации на ЭТП для доступа к ней.</li>
                            <li>Официальный сайт в сети «Интернет» - сайт в сети «Интернет», определенный уполномоченным органом государственной власти для размещения информации о проведении  торгов конкретных видов в электронной форме.</li>
                            <li>Программно-аппаратные средства ЭТП (далее – средства ЭТП) – совокупность программных материалов, оборудования и техники, шаблонов, процедур и стандартов действий, обеспечивающих функционирование ЭТП.</li>
                            <li>Протокол проведения торгов – автоматически формируемый средствами ЭТП неизменяемый протокол, отражающий действия Участников торгов непосредственно в процедуре их проведения, доступ к которому до окончания торгов не имеет ни одно из действующих на ЭТП лиц.</li>
                            <li>Регистрация ─ процедура фиксации в установленном порядке лиц на ЭТП и получение доступа к закрытой части ЭТП.</li>
                            <li>Сертификат ключа проверки электронной подписи - электронный документ или документ на бумажном носителе, выданные удостоверяющим центром либо доверенным лицом удостоверяющего центра и подтверждающие принадлежность ключа проверки электронной подписи владельцу сертификата ключа проверки электронной подписи.</li>
                            <li>Ставка, предложение о цене – предложение о цене предмета торгов, подаваемое заявителем (претендентом) и/или участником торгов в установленном Организатором торгов порядке.</li>
                            <li>Торги, торговая процедура – проходимые в установленном порядке на ЭТП в электронной форме аукцион.</li>
                            <li>Электронный образ документа – документ на бумажном носителе, преобразованный в электронно-цифровую форму путем сканирования с сохранением их реквизитов.</li>
                            <li>Электронный документ – документ, в котором информация представлена в электронно-цифровой форме, в т.ч. электронный образ документа.</li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    // import Header from '../components/app-header.vue';

    export default {
        name: 'Rules',
        components: {
            //Header,
        },
        data() {
            return {
            };
        },
        created() {
        },
    };
</script>
